/**jqLite库 */
/**
 * 1.addClass() 给元素添加指定的类。
 * 
 * 2.after() 在元素的后面插入内容。
 * 
 * 3.append()将内容插入到元素的尾部(仍然在元素内部)。
 * 
 * 4.attr() 获取或设置元素的属性值
 * 
 * 5.bind()/on() 给选中元素的一个或者多个事件附加一个事件处理程序。
 * 
 * 6.children()  获取元素的子元素
 * 
 * 7.clone() 创建一个元素的深复制
 * 
 * 8.contents() 获取每个元素的子节点，返回集合中包含文本和注释节点
 * 
 * 9.css() 获取或设置元素的style属性值
 * 
 * 10.data() 存储或返回与元素关联的指定数据值
 * 
 * 11.eq()  获取指定索引位置的元素
 * 
 * 12.find()  过滤元素的子节点，只能通过标签名过滤
 * 
 * 13.hasClass()  确定元素本身是否分配了给定的类
 * 
 * 14.html()  获取或设置元素的HTML内容
 * 
 * 15.next()  获取紧跟元素的兄弟元素
 * 
 * 16.off()/unbind()  通过名称移除一个事件处理程序
 * 
 * 17.parent() 获取元素的父元素
 * 
 * 18.prepend() 将内容插入到元素的开头
 * 
 * 19.prop() 获取或设置元素的属性值
 * 
 * 20.ready() 指定一个DOM加载完成时执行的函数
 * 
 * 21.remove() 从DOM中移除元素
 * 
 * 22.removeAttr() 从元素中移除一个属性
 * 
 * 23.removeClass() 从元素中移除一个，多个或者所有类
 * 
 * 24.removeData() 从元素中移除先前存储的数据
 * 
 * 25.replaceWith() 使用提供的新内容替换元素
 * 
 * 26.text() 获取或设置元素中合并的文本内容
 * 
 * 27.toggleClass() 从元素中添加或者移除一个或者多个类
 * 
 * 28.triggerHandler()  执行附加给元素的某个事件的所有事件处理程序
 * 
 * 29.val() 获取或设置元素的当前值
 * 
 * 30.wrap() 使用指定的HTML结构包裹元素
 */
